clojure-contrib-ducks-byte.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Teaching duck-streams About Bytes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-12-20 10:27:33 CET"/>
<meta name="author" content="B. Smith-Mannschott"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">
</head>
<body>
<div id="content">

<h1 class="title">Teaching duck-streams About Bytes</h1>

<p>The <a href="http://github.com/bpsm/clojure-contrib/tree/ducks-byte">ducks-byte</a> branch of <b>clojure-contrib</b> is my attempt to teach
duck-streams to be as convenient for byte streams as it now is for
textual streams.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Features </a></li>
<li><a href="#sec-2">Open Questions </a>
<ul>
<li><a href="#sec-2.1">teaching input-stream to try the CLASSPATH </a></li>
<li><a href="#sec-2.2"><code>*append-to-writer*</code> renamed </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Features </h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
input-stream is like reader, except for bytes.

</li>
<li>
output-stream is like writer, except for bytes.

</li>
<li>
reader and writer now build on input-stream and output-stream
where appropriate.

</li>
<li>
I've taught input-stream to also try the CLASSPATH when given a
String doesn't specify a File or a URL.

</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Open Questions </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1">teaching input-stream to try the CLASSPATH </h3>
<div class="outline-text-3" id="text-2.1">


<p>
Calls which previously would have failed (because no such file
existed) might now succeed because a resource of the same name
happens to exist on the CLASSPATH. Is this acceptable?
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><code>*append-to-writer*</code> renamed </h3>
<div class="outline-text-3" id="text-2.2">


<p>
This might be a compatibility issue for clients that did not heed
the advice given in documentation to use append-writer or
append-spit instead of directly binding this var.
</p>
</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2009-12-20 10:27:33 CET</p>
</div>
</div>
</body>
</html>
